In [112]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [113]:
#import data set with coffee prices
ts_ico = pd.read_excel('Files/ICO composite and group indicator prices -US cents - LB.xlsx')

In [114]:
#cut the beginning of the list to fit with the time frame of other variables
ts_ico = ts_ico[12:]

In [115]:
ts_ico.head(3)

,Unnamed: 0,ICO composite indicator,Colombian Milds,Other Milds,Brazilian Naturals,Robustas
12,1991-01-01,69.38,91.55,85.93,75.59,52.83
13,1991-02-01,70.55,94.21,89.21,79.39,51.87
14,1991-03-01,72.47,99.36,93.56,83.83,51.37

In [116]:
ts_ico.rename(columns={'Unnamed: 0':'Date'}, inplace=True)

In [117]:
ts_ico = ts_ico.set_index('Date')

In [118]:
#import our target variable - Farm brother stock price
ts_farm = pd.read_csv('Files/FARM.csv')
ts_farm = ts_farm.iloc[2476:]
ts_farm.Date = pd.to_datetime(ts_farm.Date)
ts_farm.set_index('Date', inplace=True)
ts_farm = ts_farm.resample('M').mean()
ts_farm = ts_farm.iloc[12:]
ts_farm.tail()

                Close
Date
2019-01-31  24.420952
2019-02-28  24.236316
2019-03-31  22.580476
2019-04-30  20.404286
2019-05-31  19.100556

In [119]:
#add the values to joint table
ts_ico['Target'] = ts_farm['Close'].values

In [120]:
ts_ico.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 341 entries, 1991-01-01 to 2019-05-01
Data columns (total 6 columns):
ICO composite indicator    341 non-null float64
Colombian
 Milds           341 non-null float64
Other Milds                341 non-null float64
Brazilian
 Naturals        341 non-null float64
Robustas                   341 non-null float64
Target                     341 non-null float64
dtypes: float64(6)
memory usage: 18.6 KB

In [121]:
#import historical rain data from columbia
ts_rain =  pd.read_csv('Files/rain_fall_columbia.csv')
ts_rain.head(3)

   Rainfall - (MM)   Year  Month    Country  ISO3
0          66.1624   1991    Jan   Colombia   COL
1          77.9094   1991    Feb   Colombia   COL
2         235.8180   1991    Mar   Colombia   COL

In [122]:
#adding the values to the joint table
ts_ico['Rainfall - (MM)'] = ts_rain['Rainfall - (MM)'].values

In [123]:
#import US bonds data
ts_bond = pd.read_csv('Files/bonds.csv')
ts_bond.head(3)

       Date  Bond _Value
0  1/2/1990         7.94
1  1/3/1990         7.99
2  1/4/1990         7.98

In [124]:
len(ts_bond)

7408

In [125]:
#checking for null values
ts_bond.isnull().sum()

Date            0
Bond _Value    27
dtype: int64

In [126]:
#filling the null vaues with the value of the previous day
ts_bond.fillna(method='ffill', inplace = True)
ts_bond.isnull().sum()

Date           0
Bond _Value    0
dtype: int64

In [127]:
ts_bond.Date = pd.to_datetime(ts_bond.Date)

In [128]:
ts_bond = ts_bond.set_index('Date')

In [129]:
#resample the data to months form
ts_bond  = ts_bond.resample('M').mean()

In [130]:
len (ts_bond)

353

In [131]:
#fitting the length to the other variables
ts_bond = ts_bond.iloc[12:]

In [132]:
#adding the values to the joint table
ts_ico['Bond _Value'] = ts_bond['Bond _Value'].values

In [133]:
ts_ico.head(2)

,ICO composite indicator,Colombian Milds,Other Milds,Brazilian Naturals,Robustas,Target,Rainfall - (MM),Bond _Value
Date,,,,,,,,
1991-01-01,69.38,91.55,85.93,75.59,52.83,8.203409,66.1624,8.090000
1991-02-01,70.55,94.21,89.21,79.39,51.87,8.810526,77.9094,7.854737

In [134]:
#importing tea price data from the Mombasa/Nairobi auctions
ts_tea = pd.read_excel('Files/Tea Prices.xlsx')
#price is per kilo. changing to pound and than to cents
ts_tea['Price'] = ts_tea['Price'] * 0.4535 *100
ts_tea.rename(columns = {'Price':'Tea_Price_Mombasa_Nairobi_auctions)'}, inplace=True)
ts_tea.set_index('Month', inplace=True)

In [135]:
#fitting the length to the other variables
ts_tea = ts_tea.iloc[21:]

In [136]:
ts_tea.head(2)

            Tea_Price_Mombasa_Nairobi_auctions)
Month
1991-01-01                              70.2925
1991-02-01                              67.1180

In [137]:
#adding the values to the joint table
ts_ico['Tea_Price'] = ts_tea['Tea_Price_Mombasa_Nairobi_auctions)'].values

In [138]:
#umport Starbucks stock data
ts_sb = pd.read_csv('Files/SBUX.csv')
ts_sb.head(3)

        Date     Close
0  6/26/1992  0.335938
1  6/29/1992  0.359375
2  6/30/1992  0.347656

In [139]:
ts_sb['Date'] = pd.to_datetime(ts_sb['Date'])

In [140]:
ts_sb = ts_sb.set_index('Date')

In [141]:
#resample the data to months form
ts_sb = ts_sb.resample('M').mean()

In [142]:
ts_sb.head(1)

               Close
Date
1992-06-30  0.347656

In [143]:
ts_ico = ts_ico.iloc[17:]

In [144]:
ts_ico['Starbucks'] = ts_sb['Close'].values

In [145]:
ts_ico.head(3)

,ICO composite indicator,Colombian Milds,Other Milds,Brazilian Naturals,Robustas,Target,Rainfall - (MM),Bond _Value,Tea_Price,Starbucks
Date,,,,,,,,,,
1992-06-01,48.13,64.10,59.09,49.08,37.17,11.820455,194.595,7.261818,76.188,0.347656
1992-07-01,48.70,62.50,58.20,48.53,39.19,11.572727,249.382,6.844545,79.816,0.399325
1992-08-01,45.89,56.49,52.93,46.40,38.85,11.558929,217.829,6.585714,81.630,0.399833

In [146]:
#exporting the file
ts_ico.to_csv(r'C:\Users\homer\Desktop\dataset_updated.csv')